Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase.IsOuterContourValid(Autodesk.Revit.DB.CurveLoop)
Checks if contour is valid for this Analytical Surface.
Remarks:
This method verifies if the contour is valid for a planar Analytical Surface or for a curved Analytical Panel.
contour:
The curve loop to be checked.
Returns:
Returns true if curve loop is ok, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase.IsCurveLoopValid(Autodesk.Revit.DB.CurveLoop)
Checks if curve loop is valid for Analytical Surface.
profile:
The curve loop to be checked.
Returns:
Returns true if curve loop is ok, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023

Autodesk.Revit.DB.Structure.AnalyticalSurfaceBase.SetOuterContour(Autodesk.Revit.DB.CurveLoop)
Sets the Curve Loop that defines the geometry of the Analytical Surface element.
Remarks:
Curve Loop must be planar and not self-intersecting.
outerContour:
New Curve Loop for the Analytical Surface element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023